In [96]:
import pandas as panda

In [97]:
tabela = panda.read_csv('dados/Matriculados.csv', header = 0, sep = ';', encoding = 'utf-8')

In [98]:
tabela.head()

    nome  idade  peso altura sexo
0  Maria     20    71   1,64    F
1  Pedro      8    33    1,2    M
2  Pablo     46    90    1,9    M
3  Joana     83    58   1,54    F

In [99]:
tabela['nome']

0    Maria
1    Pedro
2    Pablo
3    Joana
Name: nome, dtype: object

In [100]:
colunas = ['nome', 'peso']

In [101]:
tabela[colunas]

    nome  peso
0  Maria    71
1  Pedro    33
2  Pablo    90
3  Joana    58

In [102]:
tabela.iloc[1:3,1:3]

   idade  peso
1      8    33
2     46    90

In [103]:
nFilhos = [0,0,1,2]

In [105]:
tabela['nFilhos'] = nFilhos
tabela.head()

    nome  idade  peso altura sexo  nFilhos
0  Maria     20    71   1,64    F        0
1  Pedro      8    33    1,2    M        0
2  Pablo     46    90    1,9    M        1
3  Joana     83    58   1,54    F        2

In [108]:
tabela.drop(['nFilhos'], axis=1)

    nome  idade  peso altura sexo
0  Maria     20    71   1,64    F
1  Pedro      8    33    1,2    M
2  Pablo     46    90    1,9    M
3  Joana     83    58   1,54    F

In [110]:
tabela2 = tabela.drop(['nFilhos'], axis=1)
tabela2.head()

    nome  idade  peso altura sexo
0  Maria     20    71   1,64    F
1  Pedro      8    33    1,2    M
2  Pablo     46    90    1,9    M
3  Joana     83    58   1,54    F

In [111]:
tabela.drop(['nFilhos'], axis=1, inplace=True)
tabela.head()

    nome  idade  peso altura sexo
0  Maria     20    71   1,64    F
1  Pedro      8    33    1,2    M
2  Pablo     46    90    1,9    M
3  Joana     83    58   1,54    F